In [18]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
# Utilizando merge y joins obtener un dataframe como resultado de los tres anteriores

In [19]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [20]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [21]:
df3

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [22]:
merged = pd.merge(df1, df2)
merged = pd.merge(merged, df3)
merged

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [23]:
# Generar un nuevo dataframe que contenga el resultado de los tres anteriores y df4
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']})
df4

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [38]:
final = pd.merge(merged, df4, left_on='employee', right_on='applier')
final

  employee        group  hire_date supervisor applier          position
0      Bob   Accounting       2008      Carly     Bob               CTO
1     Jake  Engineering       2012      Guido    Jake  Senior Developer
2     Lisa  Engineering       2004      Guido    Lisa               CFO
3      Sue           HR       2014      Steve     Sue        Head of HR

In [39]:
# Utilizar el m√©todo drop() para eliminar las columnas redudantes
final.drop('applier', axis=1)

  employee        group  hire_date supervisor          position
0      Bob   Accounting       2008      Carly               CTO
1     Jake  Engineering       2012      Guido  Senior Developer
2     Lisa  Engineering       2004      Guido               CFO
3      Sue           HR       2014      Steve        Head of HR

In [30]:
df1 = pd.DataFrame({"a":[1],"b":[2],"c":[3]})
df2 = pd.DataFrame({"a":[1,4],"b":[7,9],"c":[8,9]})
# Utilizando los DataFrames anteriores realizar un inner, outer, left y right join entre ellos.
# Antes de ejecutar cada join escribir un comentario con el output esperado.

In [31]:
df1

   a  b  c
0  1  2  3

In [32]:
df2

   a  b  c
0  1  7  8
1  4  9  9

In [33]:
# inner
#   expected:
#     
pd.merge(df1, df2, how='inner')

Empty DataFrame
Columns: [a, b, c]
Index: []

In [34]:
# inner
#   expected:
#     
#       a b c
#     0 1 2 3
#     1 1 7 8
#     2 4 9 9
pd.merge(df1, df2, how='outer')

   a  b  c
0  1  2  3
1  1  7  8
2  4  9  9

In [36]:
# inner
#   expected:
#     
#       a b c
#     0 1 2 3
pd.merge(df1, df2, how='left')

   a  b  c
0  1  2  3

In [37]:
# inner
#   expected:
#     
#       a b c
#     0 1 7 8
#     1 4 9 9
pd.merge(df1, df2, how='right')

   a  b  c
0  1  7  8
1  4  9  9